-- phpMyAdmin SQL Dump
-- version 5.1.3
-- https://www.phpmyadmin.net/
--
-- ホスト: localhost
-- 生成日時: 2022 年 5 月 28 日 23:12
-- サーバのバージョン： 10.4.21-MariaDB
-- PHP のバージョン: 8.1.5

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- データベース: `review_base`
--

-- --------------------------------------------------------

--
-- テーブルの構造 `shops`
--

CREATE TABLE `shops` (
  `shops_id` int(11) NOT NULL,
  `reviewer_name` varchar(256) COLLATE utf8mb4_bin NOT NULL,
  `shop_name` varchar(64) COLLATE utf8mb4_bin NOT NULL,
  `tel` varchar(255) COLLATE utf8mb4_bin NOT NULL,
  `url` varchar(255) COLLATE utf8mb4_bin NOT NULL,
  `address` varchar(255) COLLATE utf8mb4_bin NOT NULL,
  `genre` varchar(255) COLLATE utf8mb4_bin NOT NULL,
  `word` text COLLATE utf8mb4_bin NOT NULL,
  `time` datetime NOT NULL,
  `img` mediumblob NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_bin;

--
-- テーブルのデータのダンプ `shops`
--

INSERT INTO `shops` (`shops_id`, `reviewer_name`, `shop_name`, `tel`, `url`, `address`, `genre`, `word`, `time`, `img`) VALUES
(2, 'goodman', 'PIZZAshop', '000-000-000', 'pizza.com', '福岡県福岡市天神３丁目', 'イタリアン', 'とても美味しいですピザ屋さんです', '2022-05-22 17:45:38', ''),
(3, 'abe', 'コリアンダイニングshop', '0000', 'https:ooo', 'kagosima', '韓国料理', '韓国風焼肉のお店です。', '2022-05-22 19:01:07', ''),
(4, 'なすび', '北京飯店博多', '0000-0000-0000', 'https:ramen@umai.com', 'hakata', '中華', 'very goodな中華料理屋さんです。', '2022-05-22 19:04:54', ''),
(5, 'hakata', 'パスタ_shop', '999-9999-9999', 'https:kkk', 'tenjin', 'イタリアン', '美味しいパスタのお店です。', '2022-05-22 19:10:28', ''),
(6, 'abe', '天津飯shop', '999-9999-9999', 'https:kkk', 'tenjin', '中華', '美味しいです', '2022-05-22 23:47:42', ''),
(7, 'abe', 'ラーメン博多二号', '999-9999-9999', 'https:ramen@umai.com', '福岡', 'その他', 'ラーメン博多二号店', '2022-05-23 11:17:43', 0x43323534323842362d444330462d344645332d413943442d3830394634344438424643355f345f353030355f632e6a706567),
(8, 'abe', 'ラーメン博多3号店', '999-9999-9999', 'https:ramen@umai.com', '福岡', 'その他', 'ラーメン博多３号店', '2022-05-23 11:26:27', 0x30413444373632392d343037452d344336382d393935322d4446343746423645393230345f345f353030355f632e6a706567),
(9, 'hakata', 'okonomiyaki', '999-9999-9999', 'https:ramen@umai.com', 'kagosima', 'その他', 'very good', '2022-05-23 16:02:55', 0x30463439313532452d353036322d343643412d384437322d3535314536414437413141445f345f353030355f632e6a706567),
(10, 'なすび', 'mizutaki', '999-9999-9999', 'htpp:mizuntaki@mizu.com', '福岡', '和食', 'very good', '2022-05-23 16:05:30', 0x30463439313532452d353036322d343643412d384437322d3535314536414437413141445f345f353030355f632e6a706567),
(11, 'なすび', '道場道場', '999-9999-9999', 'https:kkk', '福岡', '和食', '純和食の綺麗なお店', '2022-05-24 03:12:27', 0x30433933444132422d444438302d344436432d423845392d4132373630344336463635375f345f353030355f632e6a706567),
(12, 'わさび', '博多寿司', '999-9999-9999', 'htpp:mizuntaki@mizu.com', '福岡', '和食', 'お寿司屋さんです', '2022-05-24 03:13:28', 0x30433933444132422d444438302d344436432d423845392d4132373630344336463635375f345f353030355f632e6a706567),
(13, 'abe', 'イタリア', '999-9999-9999', 'htpp:mizuntaki@mizu.com', '福岡', 'イタリアン', 'イタリアンのお店です', '2022-05-24 03:15:25', 0x30433933444132422d444438302d344436432d423845392d4132373630344336463635375f345f353030355f632e6a706567),
(14, 'なすび', 'sushiwassyoi', '999-9999-9999', 'https:kkk', '福岡', '和食', '寿司屋です', '2022-05-24 09:16:37', 0x30433933444132422d444438302d344436432d423845392d4132373630344336463635375f345f353030355f632e6a706567);

-- --------------------------------------------------------

--
-- テーブルの構造 `shop_no`
--

CREATE TABLE `shop_no` (
  `id` int(11) NOT NULL,
  `shops_no` int(11) NOT NULL,
  `name` varchar(255) COLLATE utf8mb4_bin NOT NULL,
  `text` varchar(255) COLLATE utf8mb4_bin NOT NULL,
  `time` datetime NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_bin;

--
-- テーブルのデータのダンプ `shop_no`
--

INSERT INTO `shop_no` (`id`, `shops_no`, `name`, `text`, `time`) VALUES
(6, 10, 'abe', '水炊きの出汁が美味しい', '2022-05-24 08:54:19'),
(7, 3, 'あべまつ', 'とっても美味しかったです', '2022-05-24 09:11:31'),
(9, 3, 'あべまつ', '美味しいお店です', '2022-05-24 09:47:15'),
(10, 3, 'あべ松啓介', 'とにかく美味しいです', '2022-05-24 09:55:12'),
(12, 6, 'あべ松啓介', '美味しい', '2022-05-24 10:20:55'),
(14, 3, 'あべ松啓介', '美味しいです', '2022-05-24 13:30:23'),
(16, 4, 'あべ松啓介', 'oisii', '2022-05-24 14:29:59'),
(17, 7, 'abe', '美味しいですよ', '2022-05-24 16:21:11'),
(18, 4, '松本潤', '今日も美味しいです', '2022-05-26 16:11:34'),
(19, 4, 'abe', '美味しいな', '2022-05-26 16:21:29'),
(20, 10, '松本潤', '３回目の利用ですがいつもクオリティー高めでgood', '2022-05-26 16:29:43'),
(21, 10, 'gurume', 'またきます！', '2022-05-26 16:34:25'),
(22, 10, '松本潤', '4回目の利用でいつもハッピーです', '2022-05-26 16:50:15'),
(23, 10, 'グルメ太郎', 'ここはおすすめです。\r\n私のセカンドハウス', '2022-05-26 16:58:19'),
(24, 4, 'gagagaga', 'ここは私のセカンドハウス', '2022-05-26 16:59:47'),
(26, 10, 'あべまつ', '私もセカンドハウス', '2022-05-26 17:04:29'),
(27, 10, '松本潤', '５回目の利用です', '2022-05-26 17:10:19'),
(31, 10, '茄子', '初めまして', '2022-05-26 17:14:57'),
(35, 10, 'NAS', '本当に感動', '2022-05-26 17:37:28'),
(36, 10, 'あべまつ', '感動の連続です', '2022-05-26 17:39:51'),
(37, 10, 'あべまつ', '感動の連続です', '2022-05-26 17:40:41'),
(38, 10, '松本潤', '感動の連続いいですね', '2022-05-26 18:07:52'),
(39, 10, '松本潤', '感動の連続いいですね', '2022-05-26 18:08:50'),
(40, 10, '松本潤', '感動の連続いいですね', '2022-05-26 18:10:05'),
(41, 10, '松本潤', '感動の連続いいですね', '2022-05-26 18:10:13'),
(42, 10, '松本潤', '感動の連続いいですね', '2022-05-26 18:12:50'),
(43, 10, '松本潤', '感動の連続いいですね', '2022-05-26 18:14:55'),
(44, 10, '松本潤', '感動の連続いいですね', '2022-05-26 18:16:54'),
(45, 10, '松本潤', '感動の連続いいですね', '2022-05-26 18:17:48'),
(47, 10, '松本潤', '感動の連続いいですね', '2022-05-26 18:18:34'),
(48, 10, 'あべまつ', '今日は誕生日ですので利用しました', '2022-05-26 18:19:07'),
(49, 10, 'abe', '３回目の利用', '2022-05-26 18:20:29'),
(50, 10, '松本潤', 'いつもありがとうございます', '2022-05-26 18:20:53'),
(51, 10, 'はなまる', 'ここはひたすら口コミ多いですね\r\n美味しかったです', '2022-05-26 18:23:07'),
(52, 4, '松本潤', '今回３回目', '2022-05-26 18:37:26'),
(53, 1, '松本潤', '始めてきました。\r\nパンが美味しいですね。', '2022-05-26 18:40:08'),
(54, 3, '焼肉好きな人', 'キムチ最高', '2022-05-26 18:41:00'),
(55, 11, '松本潤', 'この出汁最高', '2022-05-26 18:42:07'),
(56, 12, 'あべまつ', 'ネタが新鮮', '2022-05-26 18:42:32'),
(57, 12, 'コメ好き', 'コメ美味しいと思ったら\r\n伊佐米使っていて\r\n一瞬でファンになりました。', '2022-05-26 18:45:11'),
(58, 16, '松本潤', 'いつも小うどん食べます', '2022-05-26 19:26:28'),
(59, 17, '松本潤', 'ここほんと美味しいです', '2022-05-26 20:52:39'),
(60, 17, 'あべ松啓介', '口コミで美味しいと言っていたけど\r\nその通りです', '2022-05-26 20:53:09'),
(61, 2, '松本潤', '僕の行きつけの店です', '2022-05-26 20:53:53'),
(64, 16, 'NAS', '3杯いけます', '2022-05-27 04:17:44'),
(65, 17, 'ミシマン', 'いつも利用しています。\r\nとても美味しい体験をありがとう', '2022-05-27 09:51:19'),
(69, 12, '松本潤', '美味しいでした', '2022-05-27 14:39:24');

--
-- ダンプしたテーブルのインデックス
--

--
-- テーブルのインデックス `shops`
--
ALTER TABLE `shops`
  ADD PRIMARY KEY (`shops_id`);

--
-- テーブルのインデックス `shop_no`
--
ALTER TABLE `shop_no`
  ADD PRIMARY KEY (`id`);

--
-- ダンプしたテーブルの AUTO_INCREMENT
--

--
-- テーブルの AUTO_INCREMENT `shops`
--
ALTER TABLE `shops`
  MODIFY `shops_id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=18;

--
-- テーブルの AUTO_INCREMENT `shop_no`
--
ALTER TABLE `shop_no`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=70;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
